EkspoNet/Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЭкспонатыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Экспонаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Экспонат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Экспонаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаленькийЭкспонат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаИсходная</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПриемник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EkspoNet/AccumulationRegisters/ЭкспонатыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЭкспонатыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Экспонат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Экспонаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EkspoNet/Documents/Перемещение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	  
	Для Каждого ТекСтрокаЭкспонаты Из Экспонаты Цикл
     
	// регистр ЭкспонатыНаСкладах Приход
    Движения.ЭкспонатыНаСкладах.Записывать = Истина;
	Движение = Движения.ЭкспонатыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Ячейка = ТекСтрокаЭкспонаты.ЯчейкаПриемник;
	Движение.Экспонат = ТекСтрокаЭкспонаты.Экспонат;
	Движение.Количество = 1;
	
	//регистр ЭкспонатыНаСкладах Расход
    Движения.ЭкспонатыНаСкладах.Записывать = Истина;
	Движение = Движения.ЭкспонатыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Ячейка = ТекСтрокаЭкспонаты.ЯчейкаИсходная;
	Движение.Экспонат = ТекСтрокаЭкспонаты.Экспонат;
	Движение.Количество = 1; 
	
	КонецЦикла;
	
КонецПроцедуры
